[
  {
    "details": {
      "text": "\nThe access to this dataset  can be **slow**  and is intended for **expert** users to access the **complete** set of data produced by UERRA. \n\n\n**1. Efficient download of data**<br/>\nData are stored on tapes in MARS, the ECMWF Meteorological Archival and Retrieval System. Accessing data from tapes is generally slower than accessing data directly from disk. <br/>\nTo retrieve MARS data efficiently  you should retrieve all the data you need from one tape, then from the next tape, and so on. In most cases, this means retrieving all the data you need for one month, then for the next month, and so on. <br/>\nTo find out what data is available on each tape, browse the MARS [UERRA Catalogue][uerra-catalogue]  and make your way until the bottom of the tree archive (where parameters are listed). <br/>\nOnce you will have reached that level of the archive, what you see is what you can find on one single tape.\n\n**2. Expert users**<br/>\nThe access to the complete set of UERRA data is provided through the Climate Data Store Application Program Interface (CDS API). <br/>\nThis requires the installation  of  the CDS API application in the users' computer. More information on  how to install it is  [here][cds-api-how-to].<br/>\nRequests for these data using the CDS API have to use the MARS request syntax. <br/>\nSee the [MARS keywords][mars-keyword] documentation to learn how MARS keywords can be used to retrieve and manipulate MARS data.<br/>\nData availability is not checked beforehand. This means that the requests may fail if they look for nonexistent data.<br/>\nExamples of requests using the CDS API are given in the Documentation. \n\n**3. Complete set**<br/>\nThe four other [UERRA entries][uerra-entries] in the CDS Catalogue provide a clickable form to choose and download  a subset of UERRA data. <br/>\nThey are a very convenient way for new users to discover the UERRA dataset. <br/>\nHowever, by using the CDS API,  expert users can access the whole  UERRA dataset. This includes UERRA forecast data and UERRA data on model levels.\n\n**4. Terms of use**<br/>\nUsers need to accept the Terms of use of this dataset before being able to download the data. Once logged in, a new widget will appear which allow the user to view the terms and conditions of use and accept them.\n\n\n\n [mars-keyword]: https://confluence.ecmwf.int/display/UDOC/MARS+keywords\n [cds-api-how-to]: https://cds.climate.copernicus.eu/api-how-to\n [uerra-catalogue]: https://apps.ecmwf.int/mars-catalogue/?class=ur\n [uerra-entries]: https://cds.climate.copernicus.eu/cdsapp#!/search?type=dataset&text=uerra\n"
    },
    "label": "",
    "name": "download_instructions",
    "required": false,
    "type": "FreeEditionWidget"
  },
  {
    "type": "LicenceWidget",
    "name": "licences",
    "label": "Terms of use",
    "help": null,
    "details": {
      "licences": [
        {
          "id": "licence-to-use-copernicus-products",
          "revision": 12,
          "label": "Licence to use Copernicus Products",
          "contents_url": "https://object-store.os-api.cci2.ecmwf.int:443/cci2-prod-catalogue/licences/licence-to-use-copernicus-products/licence-to-use-copernicus-productsv12_c742a3ce47ae53486a6bc9012f0496e655cd94f19fb2d01b4f6e32af69276ed1.md",
          "attachment_url": "https://object-store.os-api.cci2.ecmwf.int:443/cci2-prod-catalogue/licences/licence-to-use-copernicus-products/licence-to-use-copernicus-products_b4b9451f54cffa16ecef5c912c9cebd6979925a956e3fa677976e0cf198c2c18.pdf"
        }
      ]
    }
  }
]